; domain
(define (domain drone-dom)

    (:requirements
        :strips :typing
    )

    (:types
        drone human box content location carrier num
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry-box ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
        (carrier-at ?c - carrier ?l - location)
        (carrier-has-box ?c ?b)
        (next ?n1 ?n2 - num)
        (carrier-n-boxes ?c - carrier ?n - num)
    )

    (:action move-carrier
        :parameters (?d - drone ?to ?from - location ?c - carrier)
        :precondition (and
            (drone-free ?d)
            (drone-at ?d ?from)
            (carrier-at ?c ?from)
        )
        :effect (and
            (not(carrier-at ?c ?from)); el carrier deja de estar en la localización
            (not(drone-at ?d ?from))
            (carrier-at ?c ?to)
            (drone-at ?d ?to)
        )
    )

    (:action move
       :parameters (?d - drone ?from ?to - location)
       :precondition (and 
           (drone-at ?d ?from)
       )
       :effect (and
           (drone-at ?d ?to) 
           (not (drone-at ?d ?from))
       )
    )

    (:action put-box-on-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;debe estar bajado el carrier
            (drone-carry-box ?d ?b) ;el dron tiene que tener la caja (haber hecho pick-up)
            (next ?n1 ?n2) ;no ha llegado al limite de capacidad
            (carrier-n-boxes ?c ?n1)
        )
        :effect (and
            (drone-free ?d)
            (not (drone-carry-box ?d ?b)) ;el dron deja de tener la caja
            (carrier-has-box ?c ?b) ;para tenerla el carrier
            (not (carrier-n-boxes ?c ?n1))
            (carrier-n-boxes ?c ?n2)
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry-box ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )

    (:action take-off-box-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;el carrier y el dron deben estar en el mismo sitio
            (carrier-has-box ?c ?b) ;la caja a coger la tiene que tener el carrier
            (drone-free ?d) ;el dron tiene que estar vacio
            (carrier-n-boxes ?c ?n2)
            (next ?n1 ?n2)
        )
        :effect (and
            (not(drone-free ?d))
            (drone-carry-box ?d ?b) ;el dron coge la caja, y
            (not(carrier-has-box ?c ?b)) ;el carrier ya no la tendrá
            (carrier-n-boxes ?c ?n1)
            (not(carrier-n-boxes ?c ?n2))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry-box ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry-box ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r1_l10_p10_c10_g10_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
	human8 - human
	human9 - human
	human10 - human
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(carrier-at carrier1 warehouse)
	(carrier-n-boxes carrier1 n0)
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-at box8 warehouse)
	(box-free box8)
	(box-at box9 warehouse)
	(box-free box9)
	(box-at box10 warehouse)
	(box-free box10)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 food)
	(box-has box6 food)
	(box-has box7 food)
	(box-has box8 food)
	(box-has box9 food)
	(box-has box10 meds)
	(human-at human1 loc4)
	(human-at human2 loc8)
	(human-at human3 loc8)
	(human-at human4 loc1)
	(human-at human5 loc1)
	(human-at human6 loc2)
	(human-at human7 loc5)
	(human-at human8 loc1)
	(human-at human9 loc4)
	(human-at human10 loc5)
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
)

(:goal (and
	(drone-at drone1 warehouse)
	(carrier-at carrier1 warehouse)
	(human-has human1 food)
	(human-has human2 food)
	(human-has human3 food)
	(human-has human4 meds)
	(human-has human5 food)
	(human-has human6 food)
	(human-has human7 food)
	(human-has human8 food)
	(human-has human9 food)
	(human-has human10 food)
	))
)

; plan
1. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry-box drone1 box2)
   goals met: 2 of 12
2. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 1 of 12
3. (move drone1 loc8 loc1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 loc1)
   goals met: 1 of 12
4. (drop drone1 box2 food loc1 human5)
   deleted: (drone-carry-box drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc1) (human-has human5 food)
   goals met: 2 of 12
5. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 12
6. (pick-up drone1 box5 food warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry-box drone1 box5)
   goals met: 3 of 12
7. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 2 of 12
8. (drop drone1 box5 food loc1 human8)
   deleted: (drone-carry-box drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc1) (human-has human8 food)
   goals met: 3 of 12
9. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 12
10. (pick-up drone1 box10 meds warehouse)
   deleted: (drone-free drone1) (box-at box10 warehouse)
   added: (drone-carry-box drone1 box10)
   goals met: 4 of 12
11. (move drone1 warehouse loc10)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc10)
   goals met: 3 of 12
12. (move drone1 loc10 loc1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 loc1)
   goals met: 3 of 12
13. (drop drone1 box10 meds loc1 human4)
   deleted: (drone-carry-box drone1 box10) (box-free box10)
   added: (drone-free drone1) (box-at box10 loc1) (human-has human4 meds)
   goals met: 4 of 12
14. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 12
15. (pick-up drone1 box8 food warehouse)
   deleted: (drone-free drone1) (box-at box8 warehouse)
   added: (drone-carry-box drone1 box8)
   goals met: 5 of 12
16. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 4 of 12
17. (drop drone1 box8 food loc8 human2)
   deleted: (drone-carry-box drone1 box8) (box-free box8)
   added: (drone-free drone1) (box-at box8 loc8) (human-has human2 food)
   goals met: 5 of 12
18. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 12
19. (pick-up drone1 box7 food warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry-box drone1 box7)
   goals met: 6 of 12
20. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 5 of 12
21. (drop drone1 box7 food loc4 human9)
   deleted: (drone-carry-box drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc4) (human-has human9 food)
   goals met: 6 of 12
22. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 12
23. (pick-up drone1 box6 food warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry-box drone1 box6)
   goals met: 7 of 12
24. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 6 of 12
25. (drop drone1 box6 food loc4 human1)
   deleted: (drone-carry-box drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc4) (human-has human1 food)
   goals met: 7 of 12
26. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 12
27. (pick-up drone1 box9 food warehouse)
   deleted: (drone-free drone1) (box-at box9 warehouse)
   added: (drone-carry-box drone1 box9)
   goals met: 8 of 12
28. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 7 of 12
29. (drop drone1 box9 food loc2 human6)
   deleted: (drone-carry-box drone1 box9) (box-free box9)
   added: (drone-free drone1) (box-at box9 loc2) (human-has human6 food)
   goals met: 8 of 12
30. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 12
31. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry-box drone1 box3)
   goals met: 9 of 12
32. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 8 of 12
33. (drop drone1 box3 food loc5 human10)
   deleted: (drone-carry-box drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc5) (human-has human10 food)
   goals met: 9 of 12
34. (move drone1 loc5 warehouse)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 12
35. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry-box drone1 box4)
   goals met: 10 of 12
36. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 9 of 12
37. (drop drone1 box4 food loc5 human7)
   deleted: (drone-carry-box drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc5) (human-has human7 food)
   goals met: 10 of 12
38. (move drone1 loc5 loc8)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 loc8)
   goals met: 10 of 12
39. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 12
40. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry-box drone1 box1)
   goals met: 11 of 12
41. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 10 of 12
42. (drop drone1 box1 food loc8 human3)
   deleted: (drone-carry-box drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc8) (human-has human3 food)
   goals met: 11 of 12
43. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 12
